## 데이터 로드

In [1]:
import pandas as pd

naver_hybe = pd.read_csv('../../../data/Naver/naver_hybe.csv')

In [2]:
naver_hybe.head()

       period    ratio title
0  2023-01-01  1.83979  HYBE
1  2023-01-02  3.94693  HYBE
2  2023-01-03  5.50590  HYBE
3  2023-01-04  4.28409  HYBE
4  2023-01-05  3.62391  HYBE

## period 변수 변환
- datetime 형식으로 변환 
- 변수명 'date'로 변경

In [3]:
# 변수명 변경
naver_hybe.rename(columns={'period': 'date'}, inplace=True)

# 변수 형식 변경
naver_hybe['date'] = pd.to_datetime(naver_hybe['date'])
naver_hybe.head() # 확인

        date    ratio title
0 2023-01-01  1.83979  HYBE
1 2023-01-02  3.94693  HYBE
2 2023-01-03  5.50590  HYBE
3 2023-01-04  4.28409  HYBE
4 2023-01-05  3.62391  HYBE

## title 변수에 따라 데이터프레임 분할

- 이 검색량 데이터의 그룹은 5개이다. 
- 'HYBE', 'NEWJEANS', 'BTS', 'LESSERAFIM', 'SEVENTEEN'

In [4]:
naver_hybe['title'].unique()

array(['HYBE', 'NEWJEANS', 'BTS', 'LESSERAFIM', 'SEVENTEEN'], dtype=object)

In [5]:
df1 = naver_hybe[naver_hybe['title'] == 'HYBE']
df2 = naver_hybe[naver_hybe['title'] == 'NEWJEANS']
df3 = naver_hybe[naver_hybe['title'] == 'BTS']
df4 = naver_hybe[naver_hybe['title'] == 'LESSERAFIM']
df5 = naver_hybe[naver_hybe['title'] == 'SEVENTEEN']

In [6]:
df1.head()

        date    ratio title
0 2023-01-01  1.83979  HYBE
1 2023-01-02  3.94693  HYBE
2 2023-01-03  5.50590  HYBE
3 2023-01-04  4.28409  HYBE
4 2023-01-05  3.62391  HYBE

In [7]:
# 인덱스를 0부터 시작하는 정수로 리셋
df1.reset_index(drop=True, inplace=True)
df2.reset_index(drop=True, inplace=True)
df3.reset_index(drop=True, inplace=True)
df4.reset_index(drop=True, inplace=True)
df5.reset_index(drop=True, inplace=True)

## 날짜별 검색량 총합 구하기

In [8]:
merged_df = pd.DataFrame()

In [9]:
merged_df['date'] = df1['date']

In [10]:
merged_df['ratio_sum'] = df1['ratio']+df2['ratio']+df3['ratio']+df4['ratio']+df5['ratio']

In [11]:
merged_df

          date  ratio_sum
0   2023-01-01   50.67710
1   2023-01-02   61.60318
2   2023-01-03   64.10628
3   2023-01-04   58.39454
4   2023-01-05   56.27729
..         ...        ...
176 2023-06-26   28.49275
177 2023-06-27   29.96373
178 2023-06-28   31.50002
179 2023-06-29   29.66024
180 2023-06-30   32.49894

[181 rows x 2 columns]

In [12]:
# csv 파일로 저장 
merged_df.to_csv('../../../data/Naver/naver_preprocessed_hybe.csv',index = False)